// const a = Number.parseInt(prompt("Enter number a: "));
// const b = Number.parseInt(prompt("Enter number b: "));
// const s = a + b;
// alert("Sum of " + a + " and " + b + " = " + s);
// alert(`Sum of ${a} and ${b} = ${s}`);

// const a = Number.parseInt(prompt("Enter number a: "));
// const b = Number.parseInt(prompt("Enter number b: "));

// function sumOf(num1, num2) {
//     return num1 + num2;
// }

// alert(`Sum of ${a} and ${b} = ${sumOf(a, b)}`);



// Задача 4: вывести на экран в диалоговом окне текст с сообщением “Вам хорошо живется?”и кнопками «ОК», «Отмена», для чего необходимо использовать confirm.- При нажатии на кнопку “ОК” вывести в диалоговом окне текст с сообщением “Тогда мы идем к вам!”.- При нажатии на кнопку “Отмена” вывести в диалоговом окне текст с сообщением “Ну вы держитесь там!”.

// const answer = confirm("Вам хорошо живется?");

// // if (answer) {
// //     alert("Тогда мы идем к вам!");
// // } else {
// //     alert("Ну вы держитесь там!");
// // }
// answer ? alert("Тогда мы идем к вам!") : alert("Ну вы держитесь там!");
//            // Если True                    // Если False








// Задача 5: перепишите код, используя конструкцию switch-case, запрашивая продукт через диалоговое окно.

// <script>
// let product = "Бананы";

// if (product == "Мандарины") {
//   alert('Мандарины стоят 100 руб/кг.');
// } else if (product == "Бананы") {
//   alert('Бананы и груши стоят 70 руб/кг.');
// } else if (product == "Груши") {
//   alert('Бананы и груши стоят 70 руб/кг.');
// } else {
//   alert('Нет такого продукта.');
// }
// </script>


// const product = prompt("Какой продукт вам нужен ?");

// switch (product) {
//     case "Мандарины":
//         alert('Мандарины стоят 100 руб/кг.');
//         break;
//     case "Бананы":
//     case "Груши":
//     case "Хрен":
//         alert('Бананы, хрен и груши стоят 70 руб/кг.');
//         break;
//     default:
//         alert('Нет такого продукта.');
// }





// Задача 3: Написать функцию, которая принимает имя пользователя при ее вызове и выводит сообщение с приветствием пользователя по имени в консоль. Проверить работоспособность функции.


// function hello(userName) {
//     console.log(`Hello ${userName}`);
// }

// const user = prompt("Enter your name: ");

// hello(user);


// Ну это прям мега потная задачка конечно.
// Я ее расписал, чтобы было ясно что тут происходит для вас.

// function f(clockArr, money) {
//     // сортируем массив, чтобы определить пары часов с наименьшими ценами
//     // чтобы точно можно было сказать, что нам хватит на пару часов.
//     let sortedClocks = clockArr.sort((a, b) => a - b);
//     // сумму изначально указываем как 0
//     let sum = 0;
//     // проходимся по всему сортированному списку с шагом 1,
//     // sortedClocks.length - 1 так как нам надо по индексам идти.
//     for (let i = 0; i < sortedClocks.length - 1; i++) {
//         // считаем сумму, постоянно переопределяя ее для каждой пары.
//         // элемент определенный и следующий за ним.
//         sum = sortedClocks[i] + sortedClocks[i + 1];
//         // проверяем условие, если сумма меньше или равна money - возвращаем true, иначе false
//         if (sum <= money) {
//             return true;
//         }
//     }
//     return false;
// }